# Text Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiSegmentGrid..::..Text Property
MultiSegmentGrid Class See Also
---
name shared by grids in this MultiSegmentGrid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Text { get; set; }
```

Visual Basic
---
```text
Public Property Text As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace